/*
Localizable.strings
PanicLibSSH2

Created by heather on 11/13/15.
Copyright © 2015 Panic. All rights reserved.
*/

"SSH initialization failed." = "SSH初期化に失敗しました。";
"SSH connection was cancelled." = "SSH接続はキャンセルされました。";
"Couldn't connect to server." = "サーバに接続できませんでした。";
"Session startup failed." = "セッションの開始に失敗しました。";
"Password authentication not allowed." = "パスワード認証は許可されていません。";
"Username or password was not accepted by the server." = "ユーザ名かパスワードがサーバに許可されませんでした。";
"Key file was not accepted by the server." = "認証鍵がサーバに許可されませんでした。";
"Key file passphrase or authentication code was not accepted by the server." = "認証鍵のパスフレーズか認証コードがサーバに許可されませんでした。";
"Session request failed." = "セッションリクエストに失敗しました。";
"PTY request failed." = "PTYリクエストに失敗しました。";
"Shell request failed." = "シェルリクエストに失敗しました。";
"Read data unavailable." = "読み込みデータは利用できません。";
"Verification code was not accepted by the server." = "確認コードがサーバに許可されませんでした。";
"The %@ %@ fingerprint is:\n%@" = "%@ %@ フィンガープリント:\n%@";
"RSA" = "RSA";
"DSA" = "DSA";
"ECDSA" = "ECDSA";
"Ed25519" = "Ed25519";
"MD5" = "MD5";
"SHA1" = "SHA1";
"SHA256" = "SHA256";
"Unknown" = "不明";
"Connecting to Server." = "サーバに接続しています。";

// SFTP Connection errors
"Connection cancelled." = "接続はキャンセルされました。";
"Connection failed." = "接続に失敗しました。";
"Connection closed." = "接続が閉じました。";
"An unexpected end of file error occurred." = "予期しないファイル終了エラーが発生しました。";
"Command failed." = "失敗しました。.";
"Bad message." = "不正なメッセージです。";
"Read error." = "読み込みエラーです。";
"Write error." = "書き込みエラーです。";
"Remote stat failed." = "ファイルを見つけることができませんでした。ファイル名が変更されたり移動されたりしていないことを確認してください。";
"Local stat failed." = "ファイルを見つけることができませんでした。ファイル名が変更されたり移動されたりしていないことを確認してください。";
"Couldn't set local permissions." = "ローカルのアクセス権を設定できませんでした。";
"Couldn't set local file time." = "ローカルファイルの時間をセットできませんでした。";
"Can't download a directory." = "ディレクトリをダウンロードできませんでした。";
"Couldn't get remote handle." = "リモートハンドルを取得できませんでした。";
"Couldn't create local file." = "ローカルファイルを作成できませんでした。";
"Data packet too big." = "データパケットが大きすぎます。";
"Attributes missing permissions." = "不明なアクセス権属性です。";
"Protocol error." = "プロトコルエラーです。";
"Unable to extract public key from private key file." = "秘密鍵から公開鍵を生成できませんでした。";
"Could not establish a secure connection." = "安全な接続を確立できませんでした。";
"File not found." = "ファイルが見つかりません。";
"Make sure you have permission to modify this file." = "ファイル変更するための権限があることをご確認ください。";
"Not connected." = "接続されていません。";
"Server closed connection." = "サーバが接続を閉じました。";
"Operation not supported." = "操作はサポートされていません。";
"Connection refused." = "接続は拒否されました。";
"Stat failed." = "統計に失敗しました。";
"An SSH config file contains one or more errors. Please correct them to use this file." = "SSH configファイルに1つ以上のエラーが含まれています。このファイルを使用するには修正が必要です。";
"Credentials were not accepted by the server." = "認証に使用している情報の一部がサーバに許可されませんでした。";
"Invalid port." = "無効なポートです。";
"Unable to forward port." = "ポートフォワーディングできません。";

// PCSession propmts
" Please re-enter your key passphrase." = " 鍵のパスフレーズを再入力してください。";
" Please re-enter your password." = " パスワードを再入力してください。";
" Please re-enter your verification code." = " 認証コードを再入力してください。";
"A verification code is required for %@" = "%@ の接続には識別コードが必要です";
"Please enter the pin for \"%@\"." = "\"%@\"のパスコードを入力してください。";
"Enter the key passphrase for \"%@\"." = "\"%@\" のパスフレーズを入力してください。";
" Please enter your key passphrase for \"%@\"." = " \"%@\" のパスフレーズを入力してください。";

// Server export
"Encrypted with passwords" = "パスワードで暗号化";
"Unencrypted without passwords" = "パスワード無しで非暗号化";
"export passwords" = "パスワード書き出し";
"Enter a unique password to protect the file containing your exported items." = "書き出された項目を含んだファイルを保護するため、パスワードを入力してください。";
"Transmit and Nova" = "Transmit と Nova";
"The password must be at least 12 characters long and will be used when importing into %@.\n\nThe encryption used on this file may become insecure in the future, so please delete all copies once you are finished with it." = "%@ の読み込み時に使われるパスワードは12文字以上である必要があります。\n\nこのファイルで使用される暗号化技術は将来的に安全でなくなる可能性があるため、使用終了後は速やかにすべてのコピーを削除ください。";
"Password:" = "パスワード:";
"Verify:" = "検証:";
"Unable to generate encryption key." = "暗号化鍵を生成できません。";
"Unable to initialize encryption." = "暗号化を初期化できません。";
"Encryption failed" = "暗号化に失敗しました。";
"Data is not encrypted." = "データは暗号化されていません。";
// "Invalid encryption header." = "--$$ STRING IS MISSING $$--";
"Unable to initialize decryption." = "復号化を初期化できません。";
"Decryption failed" = "復号化に失敗しました。";
"Enter the passphrase used to encrypt the exported servers." = "書き出すサーバ設定の暗号化に使用したパスフレーズを入力してください。";

// SK Keys
"Unable to generate SK Key." = "SKキーを生成できません。";
"Please ensure your authenticator is connected and your PIN is correct." = "Authenticatorが接続されており、PINが正しいことをご確認ください。";

// Ccertificates
"Untitled" = "名称未設定";
"None" = "なし";
"Expires: " = "期限切れ: ";
"Could not import data from file." = "ファイルからデータを読み込めませんでした。";
